
#include <iostream>
using namespace std;

int main()
{
    /////////////////////

    setlocale(LC_ALL, "");

    /*составить программу перевода старинных русских мер длинны торгового и аптекарского веса*/

    ////////////////////////////
    /*
    int i;
    cin >> i;
    cout << i << "саженец = " << 2.1386 * i << "метров" << endl;
    cout << i << "дюймов = " << 2.5 * i << "сантиметров" << endl;
    cout << i << "футов = " << 0.3040 * i << "метров" << endl;
    cout << i << "драхмы = " << 3.7325 * i << "граммов" << endl;
    cout << i << "унций = " << 25.86 * i << "граммов" << endl;
    cout << i << "футов = " << 0.40951 * i << "километров" << endl;
    cout << i << "аршинов = " << 0.7112 * i << "метров" << endl;
    cout << i << "золотников = " << 4.2657 * i << "граммов" << endl;
    cout << i << "дюймов = " << 25.3995 * i << "миллиметров" << endl;
    */


    ///////////////////////////////////

   /* в сберкассу на трёхпроцентный вклад положили 5 рублей.какой 
   станет сумма вклада через N лет */

    /*
    int n;
    float x, v, s = 5;
   
    cout << "на сколько лет вклад: ";
    cin >> n;
    x = s * 3 / 100;
    v = s + x * n;
    cout << "Сумма через  " << n << " лет: " << v << endl;
    */

    //////////////////////////////////

    /* ввести с клавиатуры 10 пар чисел. сравнить эти числа в каждой
    паре и напечатать большее из нихи */


    ///////////////////////////////

    /* даны натуральные числа от35 до 87. найти и напечатать
    те из них которые при делении на 7 дают остаток 1, 2 или 5 */
    
    /*
    for (int i = 35; i <= 87; i++)
    {
        if ((i % 7 == 1) || (i % 7 == 2) || (i % 7 == 5))
        {
            cout << i << endl;
        }
    }
    */

    /////////////////////////////

    /* даны натуральные числа от 1 до 50. найти сумму тех из них, которые делятся на 5 или на 7 */
   
    
    
    int sum = 0;
    for (int i = 1; i <= 50; i++)
        if (i % 5 == 0 || i % 7 == 0) sum += i;
    cout << "сумма : " << sum;
    
}